= 広報のネタ切れに素早く、よく効くChatGPT

//flushright{
ふーれむ@<fn>{ふーれむ}
//}

== 広報に私が入った経緯とか

こんにちは。広報担当のふーれむです。

//footnote[ふーれむ][普段は「ふれーむ」と名乗ってますが、技術同人誌の時だけはミーム汚染を避けるため「ふーれむ」と名乗っています。]

もともとはパンフを手伝うだけのスタッフのつもりで技書博コアスタッフに参画したんですが、技書博6準備期間の途中ぐらいでチームの仕切り直しがあり、このタイミングから広報に入るようになりました。

まあ、広報といってもそんな大したことをやっているわけでもなくて、基本的にはツイッターで情報発信するというロールです。

これまで、イベント２つ半ぐらいの広報をやってきたわけですが、どうやら広報チームの仕事の大半は「面白いツイッターのネタを思いつく」@<fn>{neta}点にあるようです。

//footnote[neta][ネタが思いつけば、あとは組んで投稿するだけなんで……]

== 入ったあと、主導的にやっていたこと

もともと外から見ていた分には、技書博５までの技書博Twitter@<fn>{twitter}は定型文的なツイートがは多かった印象があり、個人的には、お硬めの従来型のツイートも好きだったんですが、もう少しみんなに楽しんでもらえるように面白さを足したくて、色々と試行錯誤した結果、次のようなことをやってました。

//footnote[twitter][https://twitter.com/gishohaku]

=== 普段のツイッター広報

最初に挙げるのは、やはりアニメーションgifによる初回告知系のツイートでしょうか。（画像がゆっくり切り替わる感じの）

ほら、ちょっとでも目立つほうがね……　いいじゃないですか。(紙面じゃ伝わりにくいかも。ぜひTwitterを見てもらえると～)

○技書博7の初回告知 @<fn>{6to7}
//image[6to7][技書博7告知][scale=0.6]
//footnote[6to7][https://twitter.com/gishohaku/status/1519874111920427008]

○技書博8の初回告知 @<fn>{7to8}
//image[7to8][技書博8告知][scale=0.6]
//footnote[7to8][https://twitter.com/gishohaku/status/1608813283624255489]

　

　

あとは普通の広報です。ここからは静止画。

○冷やし中華ネタをついやりたくって…… @<fn>{hiyashi}
//image[hiyashi][冷やし中華はじめました風][scale=0.4]
//footnote[hiyashi][https://twitter.com/gishohaku/status/1540288628156469251]

○言うまでもないですが、あのキャンペーンが元ネタです。 @<fn>{souda}
//image[souda][そうだ技書博出よう][scale=0.4]
//footnote[souda][https://twitter.com/gishohaku/status/1533261573027790849]

○技書博8からは絵文字使うようにもなりました。 @<fn>{ebi}
//image[ebi][えびふりゃーが誘っているよ][scale=0.6]
//footnote[ebi][https://twitter.com/gishohaku/status/1639435334537859073]

=== 広報とはちょっと角度の違うやつ

「広報」とはちょっと角度の違うやつだと、こういう事もしてました。

○技書博7ツイートまとめ @<fn>{togetter}
//image[togetter][まとめてみました][scale=0.6]
//footnote[togetter][https://togetter.com/li/1979179]

なお、このまとめはtogetter編集部イチオシまとめになり、えらくびっくりしました……　笑

技書博8でも同様にまとめる予定なので、戦利品のある人は「#技書博」タグでぜひツイートしてくださいね！

== 広報を続けた結果

広報を続けた結果、一つの壁にぶち当たりました。それはネタの枯渇です。

一人が出せるネタの幅（アイデアや文体、ネタそのものも）にはやっぱりある程度の限界がありました。

そんな時現れた一筋の光　◆ ChatGPT ◆

ということで長い前置きでしたが、今回はChatGPTを使って過去のツイッター投稿内容を再利用してみました！ @<fn>{sdgs}
//footnote[sdgs][技書博にもSDGsが！(言いたかっただけ)]


== ChatGPTの力で今までのツイッター投稿が資産に

今回は、「#技書博進捗悪イゴ祭」をターゲットに、ChatGPTにて技書博7での投稿内容からロック調の文案を10パターン程度出してもらい、これを元に、人が新しいチャット投稿文面を組んで投稿する　という形で運用を行いました。 @<fn>{rock}
//footnote[rock][なぜロック調かというと「ベイベー」って言ってるからです。もうちょっとロックになってほしかったんだ…… 笑]

=== 実際の運用など

なお先に断っておくと、スクリプトはなにも考えず適当に聞いてみただけです。

//image[chatgpt][ChatGPTに聞いてみた][scale=0.6]

この問い合わせにより、10パターン程度の候補案がでてきたものを元に検討した結果、次の文が

//emlist{
今日の午後は、#技書博進捗悪イゴ祭 。
13時までに珈琲やお茶菓子を用意して、執筆に集中できる環境を整えるんだベイべー！
進捗祭は、がんばる人のブートキャンプだ！
原稿以外の作業や、技書博に関係ない作業も大歓迎だぞ！ #技書博
//}

こうなりました。
//emlist{
今日の午後は、#技書博進捗悪イゴ祭 だ！
13時までにコーヒーやスナックをスタックし、楽曲（原稿）の制作に集中するんだ！進捗祭は、スターメーカーたちのブートキャンプだ！
原稿以外の作業や、技書博に関係ない作業も大歓迎だぜ！ #技書博
//}

技書博8の #技書博進捗悪イゴ祭 のツイートは上の例のように、全てロック調になっていますので、お時間のある方はぜひ「#技書博進捗悪イゴ祭」タグで技書博7の悪イゴ祭と、技書博8の悪イゴ祭の文章の差を確かめてみてくださいね！ @<fn>{warui}
//footnote[warui][https://twitter.com/search?q=%23技書博進捗悪イゴ祭&f=live]

== 最近の自動生成AIを使ってみて

ある程度のゆるさが許容できる分野であれば、アイデア出しや普段と違った角度を付けるのにChatGPTを使うと、たたき台やアイデア出しのスピードが段違いに上がりますね。@<fn>{speed}
//footnote[speed][体感ですが、10倍ぐらい違いました……]

あと、考えてアイデアを出す作業って時間的に見積もりがしにくいもので、どこかで時間を決めて打ち切りにしがちなものですが、ChatGPTを挟むとアイデア出しのところが大幅に手続き処理に置き換わるため、そういった点でもサクサク進められ、精神衛生上も非常に良かったです。

== さいごに

少人数で地味にこつこつと進めている広報なのですが、ちょっとは楽しめて頂けているのでしょうか？(それであれば非常に嬉しいのですが 笑)

また、いつも技書博公式ツイッターにファボ、RTをいただく皆様、本当にありがとうございます。ファボやRTを頂けると中の人が大変喜ぶので、今後も技書博公式ツイッターを応援して頂けると助かります！

　

最後になりましたが、戦利品報告もお待ちしています！(#技書博 タグをお忘れなく！)